[{"text":"The people I met today in Dayton are the finest anywhere! https://t.co/sBxKZWExcR"},{"text":"We love you Dayton, Ohio! https://t.co/IaCZAdyuzL"},{"text":"Watching Fake News CNN is better than watching Shepard Smith, the lowest rated show on @FoxNews. Actually, whenever possible, I turn to @OANN!"},{"text":"....misrepresenting what took place inside of the hospital. Their news conference after I left for El Paso was a fraud. It bore no resemblance to what took place with those incredible people that I was so lucky to meet and spend time with. They were all amazing!o"},{"text":"Just left Dayton, Ohio, where I met with the Victims &amp; families, Law Enforcement, Medical Staff &amp; First Responders. It was a warm &amp; wonderful visit. Tremendous enthusiasm &amp; even Love. Then I saw failed Presidential Candidate (0%) Sherrod Brown &amp; Mayor Whaley totally....."},{"text":"Watching Sleepy Joe Biden making a speech. Sooo Boring! The LameStream Media will die in the ratings and clicks with this guy. It will be over for them, not to mention the fact that our Country will do poorly with him. It will be one big crash, but at least China will be happy!"},{"text":"Today, we honor all of our Country’s Purple Heart recipients, their loved ones, and our Gold Star Families for their immeasurable sacrifice. These American Patriots represent the unyielding and unmatched strength and determination of the U.S. Armed Forces: https://t.co/EVhPJD5azu https://t.co/fcQMg9JI4q"},{"text":"....terrible thing to watch, especially when things could be taken care of sooo easily. We will WIN anyway, but it would be much easier if the Fed understood, which they don’t, that we are competing against other countries, all of whom want to do well at our expense!"},{"text":"....proud to admit their mistake of acting too fast and tightening too much (and that I was right!). They must Cut Rates bigger and faster, and stop their ridiculous quantitative tightening NOW. Yield curve is at too wide a margin, and no inflation! Incompetence is a....."},{"text":"“Three more Central Banks cut rates.” Our problem is not China - We are stronger than ever, money is pouring into the U.S. while China is losing companies by the thousands to other countries, and their currency is under siege - Our problem is a Federal Reserve that is too....."},{"text":"“Meanwhile, the Dayton, Ohio, shooter had a history of supporting political figures like Bernie Sanders, Elizabeth Warren, and ANTIFA.” @OANN  I hope other news outlets will report this as opposed to Fake News. Thank you!"},{"text":"“Trump Urges Unity Vs. Racism,” was the correct description in the first headline by the Failing New York Times, but it was quickly changed to, “Assailing Hate But Not Guns,” after the Radical Left Democrats went absolutely CRAZY! Fake News - That’s what we’re up against..."},{"text":"..”This is an astounding development in journalism. I’ve never seen it happen before, I’ve just never seen anything like this! Is that journalism today? I don’t think so!” Mark Penn, Former Clinton Advisor. @TuckerCarlson After 3 years I almost got a good headline from the Times!"},{"text":"South Korea has agreed to pay substantially more money to the United States in order to defend itself from North Korea. Over the past many decades, the U.S. has been paid very little by South Korea, but last year, at the request of President Trump, South Korea paid $990,000,000.."},{"text":"...Talks have begun to further increase payments to the United States. South Korea is a very wealthy nation that now feels an obligation to contribute to the military defense provided by the United States of America. The relationship between the two countries is a very good one!"},{"text":"Beto (phony name to indicate Hispanic heritage) O’Rourke, who is embarrassed by my last visit to the Great State of Texas, where I trounced him, and is now even more embarrassed by polling at 1% in the Democrat Primary, should respect the victims &amp; law enforcement - &amp; be quiet!"},{"text":"“California is trying to meddle with a ballot in order to oppose President Trump, and it’s clearly something California is not allowed to do. It violates the right of the Republican Party, or any party, to choose its leaders under the Free Speech clause, and under the 14th....."},{"text":"....Amendment.” John Yoo. @IngrahamAngle  Former Governor Jerry Brown vetoed the same bill in that it was ridiculous and totally unconstitutional. Just more of the record setting Presidential Harassment. Don’t feel badly, New York State is far worse!"},{"text":"Will be going to Dayton, Ohio and El Paso, Texas, tomorrow to meet with First Responders, Law Enforcement, and some of the victims of the terrible shootings."},{"text":"...in 2020.” Lou Dobbs stated that this is a fraud on the American public. @peterschweizer stated with certainty that they suppressed negative stories on Hillary Clinton, and boosted negative stories on Donald Trump. All very illegal. We are watching Google very closely!"},{"text":".@sundarpichai of Google was in the Oval Office working very hard to explain how much he liked me, what a great job the Administration is doing, that Google was not involved with China’s military, that they didn’t help Crooked Hillary over me in the 2016 Election, &amp; that they..."},{"text":"... are NOT planning to illegally subvert the 2020 Election despite all that has been said to the contrary. It all sounded good until I watched Kevin Cernekee, a Google engineer, say terrible things about what they did in 2016 and that they want to “Make sure that Trump losses..."},{"text":"Thank you @JimCramer @CNBC! https://t.co/DW7HDA0WEK"},{"text":"Thank you Mr. Wonderful, I like you too! @kevinolearytv @CNBC https://t.co/8n5qcTVSp2"},{"text":"As they have learned in the last two years, our great American Farmers know that China will not be able to hurt them in that their President has stood with them and done what no other president would do - And I’ll do it again next year if necessary!"},{"text":"Massive amounts of money from China and other parts of the world is pouring into the United States for reasons of safety, investment, and interest rates! We are in a very strong position. Companies are also coming to the U.S. in big numbers. A beautiful thing to watch!"},{"text":"....are NOT planning to illegally subvert the 2020 Election despite all that has been said to the contrary. It all sounded good until I watched Kevin Cernekee, a Google engineer, say terrible things about what they did in 2016 and that they want to “Make sure that Trump losses..."},{"text":"....in 2020.” Lou Dobbs stated that this is a fraud on the American public. @peterschweizer stated with certainty that they suppressed negative stories on Hillary Clinton, and boosted negative stories on Donald Ttump. All very illegal. We are watching Google very closely!"},{"text":"@sundarpichai of Google was in the Oval Office working very hard to explain how much he liked me, what a great job the Administration is doing, that Google was not involved with China’s military, that they didn’t help Crooked Hillary over me in the 2016 Election, and that they..."},{"text":"“It’s political season and the election is around the corner. They want to continue to push that racist narrative.” @ainsleyearhardt @foxandfriends  And I am the least racist person. Black, Hispanic and Asian Unemployment is the lowest (BEST) in the history of the United States!"},{"text":"“Did George Bush ever condemn President Obama after Sandy Hook. President Obama had 32 mass shootings during his reign. Not many people said Obama is out of Control. Mass shootings were happening before the President even thought about running for Pres.” @kilmeade @foxandfriends"},{"text":"Thank you @PeterSchweizer! https://t.co/TZxmiouWOm"},{"text":"Check out what @Google is up to for the 2020 election! #KAG2020 https://t.co/roM2WNmUSP"},{"text":"Thank you @LouDobbs and Tom Homan! https://t.co/VC1oNdcLEy"},{"text":"We must honor the sacred memory of those we have lost by acting as ONE PEOPLE. Open wounds cannot heal if we are divided. We must seek real, bipartisan solutions that will truly make America safer and better for all. https://t.co/ADvMn9HZW7"},{"text":"Today, I am also directing the Department of Justice to propose legislation ensuring that those who commit hate crimes and mass murders face the DEATH PENALTY - and that this capital punishment be delivered quickly, decisively, and without years of needless delay. https://t.co/BDXdpelK7F"},{"text":"The First Lady and I join all Americans in praying and grieving for the victims, their families, and the survivors. We will stand by their side FOREVER! https://t.co/zOQLvAuXoh"},{"text":"China is intent on continuing to receive the hundreds of Billions of Dollars they have been taking from the U.S. with unfair trade practices and currency manipulation. So one-sided, it should have been stopped many years ago!"},{"text":"Based on the historic currency manipulation by China, it is now even more obvious to everyone that Americans are not paying for the Tariffs – they are being paid for compliments of China, and the U.S. is taking in tens of Billions of Dollars! China has always...."},{"text":"....used currency manipulation to steal our businesses and factories, hurt our jobs, depress our workers’ wages and harm our farmers’ prices. Not anymore!"},{"text":"China dropped the price of their currency to an almost a historic low. It’s called “currency manipulation.” Are you listening Federal Reserve? This is a major violation which will greatly weaken China over time!"},{"text":"The Media has a big responsibility to life and safety in our Country. Fake News has contributed greatly to the anger and rage that has built up over many years. News coverage has got to start being fair, balanced and unbiased, or these terrible problems will only get worse!"},{"text":"We cannot let those killed in El Paso, Texas, and Dayton, Ohio, die in vain. Likewise for those so seriously wounded. We can never forget them, and those many who came before them. Republicans and Democrats must come together and get strong background checks, perhaps marrying...."},{"text":"....this legislation with desperately needed immigration reform. We must have something good, if not GREAT, come out of these two tragic events!"},{"text":"Today, I authorized the lowering of the flags to half-staff at all Federal Government buildings in honor of the victims of the tragedies in El Paso, Texas, and Dayton, Ohio...."},{"text":"....The flags at the White House will be lowered today through Thursday, August 8. Melania and I are praying for all those impacted by this unspeakable act of evil!"},{"text":"God bless the people of El Paso, Texas. God bless the people of Dayton, Ohio."},{"text":"God bless the people of El Paso Texas. God bless the people of Dayton, Ohio."},{"text":"The FBI, local and state law enforcement are working together in El Paso and in Dayton, Ohio. Information is rapidly being accumulated in Dayton. Much has already be learned in El Paso. Law enforcement was very rapid in both instances. Updates will be given throughout the day!"},{"text":"Today’s shooting in El Paso, Texas, was not only tragic, it was an act of cowardice. I know that I stand with everyone in this Country to condemn today’s hateful act. There are no reasons or excuses that will ever justify killing innocent people...."},{"text":"....Melania and I send our heartfelt thoughts and prayers to the great people of Texas."},{"text":"Today’s shooting in El Paso, Texas was not only tragic, it was an act of cowardice. I know that I stand with everyone in this Country to condemn today’s hateful act. There are no reasons or excuses that will ever justify killing innocent people...."},{"text":"....Melania and I send our heartfelt thoughts and prayers to the great people of Texas."},{"text":"'God be with you all': Trump pledges full support for El Paso shooting victims as lawmakers also grieve https://t.co/gISsidBeWr via @usatoday"},{"text":"Pastor Scott, a great guy - and tough! https://t.co/tu0u3AxQqp"},{"text":"Fight hard tonight Colby. You are a real Champ! #MAGA https://t.co/dj3JlWQu7i"},{"text":"Terrible shootings in ElPaso, Texas. Reports are very bad, many killed. Working with State and Local authorities, and Law Enforcement. Spoke to Governor to pledge total support of Federal Government. God be with you all!"},{"text":"Things are going along very well with China. They are paying us Tens of Billions of Dollars, made possible by their monetary devaluations and pumping in massive amounts of cash to keep their system going. So far our consumer is paying nothing - and no inflation. No help from Fed!"},{"text":"Countries are coming to us wanting to negotiate REAL trade deals, not the one sided horror show deals made by past administrations. They don’t want to be targeted for Tariffs by the U.S."},{"text":"Great working with you John. A big win for our amazing ranchers! https://t.co/m2PjlbTHA9"},{"text":"A great couple! https://t.co/h0o1laZ7e3"},{"text":"Nice to see that one of my best pupils is still a giant Trump fan. Steve joined me after I won the primaries, but I loved working with him! https://t.co/jRpmdrGYTB"},{"text":"Our great Republican Congressman John Ratcliffe is being treated very unfairly by the LameStream Media. Rather than going through months of slander and libel, I explained to John how miserable it would be for him and his family to deal with these people...."},{"text":"....John has therefore decided to stay in Congress where he has done such an outstanding job representing the people of Texas, and our Country. I will be announcing my nomination for DNI shortly."},{"text":"A$AP Rocky released from prison and on his way home to the United States from Sweden. It was a Rocky Week, get home ASAP A$AP!"},{"text":"....Chariman Kim has a great and beautiful vision for his country, and only the United States, with me as President, can make that vision come true. He will do the right thing because he is far too smart not to, and he does not want to disappoint his friend, President Trump!"},{"text":"Kim Jong Un and North Korea tested 3 short range missiles over the last number of days. These missiles tests are not a violation of our signed Singapore agreement, nor was there discussion of short range missiles when we shook hands. There may be a United Nations violation, but.."},{"text":".....Chairman Kim does not want to disappoint me with a violation of trust, there is far too much for North Korea to gain - the potential as a Country, under Kim Jong Un’s leadership, is unlimited. Also, there is far too much to lose. I may be wrong, but I believe that......"},{"text":"Really bad news! The Baltimore house of Elijah Cummings was robbed. Too bad!"},{"text":"THANK YOU OHIO!! #KAG2020 https://t.co/UF6b1sdC4r"},{"text":"I would like to thank two Great Iowa Senators, @ChuckGrassley and @SenJoniErnst - for their support today on the Spending Bill. Their vote, and the vote of other Republicans and Democrats helped get this done in a bipartisan fashion. Thank you all!"},{"text":"Beautiful evening in Cincinnati, Ohio tonight — with GREAT American Patriots! #KAG2020 https://t.co/wDN5B4Gp87"},{"text":"Thank you Cincinnati, Ohio. Together, we are going to KEEP AMERICA GREAT! https://t.co/sKPAW8e8qN"},{"text":"https://t.co/cbw3KXwvES"},{"text":"...We look forward to continuing our positive dialogue with China on a comprehensive Trade Deal, and feel that the future between our two countries will be a very bright one!"},{"text":"...buy agricultural product from the U.S. in large quantities, but did not do so. Additionally, my friend President Xi said that he would stop the sale of Fentanyl to the United States – this never happened, and many Americans continue to die! Trade talks are continuing, and..."},{"text":"...during the talks the U.S. will start, on September 1st, putting a small additional Tariff of 10% on the remaining 300 Billion Dollars of goods and products coming from China into our Country. This does not include the 250 Billion Dollars already Tariffed at 25%..."},{"text":"Our representatives have just returned from China where they had constructive talks having to do with a future Trade Deal. We thought we had a deal with China three months ago, but sadly, China decided to re-negotiate the deal prior to signing. More recently, China agreed to..."},{"text":"https://t.co/0Zx9wr3MoP"},{"text":"\"A string of court cases that have been run through the legal system that have hit DEAD ENDS....\" @BillHemmer @AmericaNewsroom https://t.co/lQ7tgKWM9u"},{"text":"https://t.co/It3T0ANlrs"},{"text":"BIG RALLY tonight in Cincinnati, Ohio. See you there! P.S. Our Country is doing GREAT!"},{"text":"Budget Deal is phenomenal for our Great Military, our Vets, and Jobs, Jobs, Jobs! Two year deal gets us past the Election. Go for it Republicans, there is always plenty of time to CUT!"},{"text":"China, Iran &amp; other foreign countries are looking at the Democrat Candidates and “drooling” over the small prospect that they could be dealing with them in the not too distant future. They would be able to rip off our beloved USA like never before. With President Trump, NO WAY!"},{"text":"Congratulations to Kelly Knight Craft of #Kentucky on her confirmation as United Nations Ambassador. After having served so admirably as Ambassador to Canada, &amp; having done an outstanding job no matter how difficult the task, Kelly will be fantastic at the United Nations. Winner!"},{"text":"The people on the stage tonight, and last, were not those that will either Make America Great Again or Keep America Great! Our Country now is breaking records in almost every category, from Stock Market to Military to Unemployment. We have prosperity &amp; success like never before.."},{"text":"...It will soon be time to choose to keep and build upon that prosperity and success, or let it go. We are respected again all around the world. Keep it that way! I said I will never let you down, and I haven’t. We will only grow bigger, better and stronger TOGETHER!"},{"text":"The cages for kids were built by the Obama Administration in 2014. He had the policy of child separation. I ended it even as I realized that more families would then come to the Border! @CNN"},{"text":"Experts stated that the Fed should not have tightened, and then waited too long to undo their mistake. James Bullard of St. Louis Fed said they waited too long to correct the mistake that they made last December. “Mistake, Powell cut rate and then he started talking.” @LouDobbs"},{"text":"Very low ratings for the Democratic Debate last night — they’re desperate for Trump!"},{"text":"Thank you Bill, say hello to our GREAT VETERANS! https://t.co/toDqIAIQ54"},{"text":"The Radical Left Dems went after me for using the words “drug-infested” concerning Baltimore. Take a look at Elijah C. https://t.co/E08ngbcw3d"},{"text":"“The 99% Get a Bigger Raise” https://t.co/negNLaSwMt"},{"text":"....As usual, Powell let us down, but at least he is ending quantitative tightening, which shouldn’t have started in the first place - no inflation. We are winning anyway, but I am certainly not getting much help from the Federal Reserve!"},{"text":"What the Market wanted to hear from Jay Powell and the Federal Reserve was that this was the beginning of a lengthy and aggressive rate-cutting cycle which would keep pace with China, The European Union and other countries around the world...."},{"text":"....I am very happy for Eddie Gallagher and his family!"},{"text":"....to information that may have been obtained from opposing lawyers and for giving immunity in a totally incompetent fashion. I have directed the Secretary of the Navy Richard Spencer &amp; Chief of Naval Operations John Richardson to immediately withdraw and rescind the awards...."},{"text":"The Prosecutors who lost the case against SEAL Eddie Gallagher (who I released from solitary confinement so he could fight his case properly), were ridiculously given a Navy Achievement Medal. Not only did they lose the case, they had difficulty with respect...."},{"text":"The Prosecutors who lost the case against SEAL Eddie Gallagher (who I released from solitary confinement so he could fight his case properly), were ridiculously given a Navy Achievement Medal...."},{"text":"....Not only did they lose the case, they had difficulty with respect to information that may have been obtained from opposing lawyers and for giving immunity in a totally incompetent fashion...."},{"text":"....I have directed the Secretary of the Navy Richard Spencer and Chief of Naval Operations John Richardson to immediately withdraw and rescind the awards. I am very happy for Eddie Gallagher and his family!"},{"text":"....or is he too dumb (stupid} to understand that. No wonder CNN’s ratings (MSNBC’s also) have gone down the tubes - and will stay there until they bring credibility back to the newsroom. Don’t hold your breath!"},{"text":"CNN’s Don Lemon, the dumbest man on television, insinuated last night while asking a debate “question” that I was a racist, when in fact I am “the least racist person in the world.” Perhaps someone should explain to Don that he is supposed to be neutral, unbiased &amp; fair,....."},{"text":"Lowering drug prices for many Americans - including our great seniors! At my direction, @HHSGov @SecAzar just released a Safe Importation Action Plan. Our Governors will be very happy too! @GovRonDeSantis @GovofCO https://t.co/VIxmZWgYM2"},{"text":"“The lesser of two Socialists is still a Socialist!” Senator John Kennedy of Louisiana"},{"text":"If I hadn’t won the 2016 Election, we would be in a Great Recession/Depression right now. The people I saw on stage last night, &amp; you can add in Sleepy Joe, Harris, &amp; the rest, will lead us into an economic sinkhole the likes of which we have never seen before. With me, only up!"},{"text":"Such a great victory in court yesterday on the Russian Hoax, the greatest political scam in the history of our Country. TREASON! Hopefully, the Attorney Generel of the United States, and all of those working with him, will find out, in great detail, what happened. NEVER AGAIN!!!!"}]